XAU/Models/rps_soap_request_envelope.xml

<?xml version="1.0" encoding="UTF-8"?>
<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope"
    xmlns:ps="http://schemas.microsoft.com/Passport/SoapServices/PPCRL"
    xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
    xmlns:saml="urn:oasis:names:tc:SAML:1.0:assertion"
    xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy"
    xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
    xmlns:wsa="http://www.w3.org/2005/08/addressing"
    xmlns:wssc="http://schemas.xmlsoap.org/ws/2005/02/sc"
    xmlns:wst="http://schemas.xmlsoap.org/ws/2005/02/trust">
    <s:Header>
        <wsa:Action s:mustUnderstand="1">http://schemas.xmlsoap.org/ws/2005/02/trust/RST/Issue</wsa:Action>
        <wsa:To s:mustUnderstand="1">https://login.live.com:443/RST2.srf</wsa:To>
        <wsa:MessageID>0</wsa:MessageID>
        <ps:AuthInfo xmlns:ps="http://schemas.microsoft.com/Passport/SoapServices/PPCRL" Id="PPAuthInfo">
            <ps:HostingApp>{00000000-0000-0000-0000-000000000000}</ps:HostingApp>
            <ps:BinaryVersion>50</ps:BinaryVersion>
            <ps:UIVersion>1</ps:UIVersion>
            <ps:InlineUX>Silent</ps:InlineUX>
            <ps:DeviceType>XBox</ps:DeviceType>
            <ps:PackageSID></ps:PackageSID>
            <ps:Cookies></ps:Cookies>
            <ps:RequestParams></ps:RequestParams>
            <ps:ClientCapabilities>1</ps:ClientCapabilities>
        </ps:AuthInfo>
        <wsse:Security>
            <EncryptedData xmlns="http://www.w3.org/2001/04/xmlenc#" Id="BinaryDAToken1" Type="http://www.w3.org/2001/04/xmlenc#Element">
                <EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#tripledes-cbc"></EncryptionMethod>
                <ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
                    <ds:KeyName>http://Passport.NET/STS</ds:KeyName>
                </ds:KeyInfo>
                <CipherData>
                    <CipherValue></CipherValue>
                </CipherData>
            </EncryptedData>
            <wsse:BinarySecurityToken ValueType="urn:liveid:device" id="DeviceDAToken">&lt;EncryptedData xmlns=&quot;http://www.w3.org/2001/04/xmlenc#&quot; Id=&quot;devicesoftware&quot; Type=&quot;http://www.w3.org/2001/04/xmlenc#Element&quot;&gt;&lt;EncryptionMethod Algorithm=&quot;http://www.w3.org/2001/04/xmlenc#tripledes-cbc&quot;&gt;&lt;/EncryptionMethod&gt;&lt;ds:KeyInfo xmlns:ds=&quot;http://www.w3.org/2000/09/xmldsig#&quot;&gt;&lt;ds:KeyName&gt;http://Passport.NET/STS&lt;/ds:KeyName&gt;&lt;/ds:KeyInfo&gt;&lt;CipherData&gt;&lt;CipherValue&gt;&lt;/CipherValue&gt;&lt;/CipherData&gt;&lt;/EncryptedData&gt;</wsse:BinarySecurityToken>
            <wsse:UsernameToken wsu:Id="user">
                <wsse:UsernameHint></wsse:UsernameHint>
                <wsse:LoginOption>1</wsse:LoginOption>
            </wsse:UsernameToken>
            <wsu:Timestamp wsu:Id="Timestamp">
                <wsu:Created></wsu:Created>
                <wsu:Expires></wsu:Expires>
            </wsu:Timestamp>
            <Signature xmlns="http://www.w3.org/2000/09/xmldsig#">
                <SignedInfo>
                    <CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"></CanonicalizationMethod>
                    <SignatureMethod Algorithm="http://www.w3.org/2001/04/xmldsig-more#ecdsa-sha256"></SignatureMethod>
                    <Reference URI="#RSTS">
                        <Transforms>
                            <Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"></Transform>
                        </Transforms>
                        <DigestMethod Algorithm="http://www.w3.org/2001/04/xmlenc#sha256"></DigestMethod>
                        <DigestValue></DigestValue>
                    </Reference>
                    <Reference URI="#Timestamp">
                        <Transforms>
                            <Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"></Transform>
                        </Transforms>
                        <DigestMethod Algorithm="http://www.w3.org/2001/04/xmlenc#sha256"></DigestMethod>
                        <DigestValue></DigestValue>
                    </Reference>
                    <Reference URI="#PPAuthInfo">
                        <Transforms>
                            <Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"></Transform>
                        </Transforms>
                        <DigestMethod Algorithm="http://www.w3.org/2001/04/xmlenc#sha256"></DigestMethod>
                        <DigestValue></DigestValue>
                    </Reference>
                </SignedInfo>
                <SignatureValue></SignatureValue>
                <KeyInfo>
                    <wsse:SecurityTokenReference>
                        <wsse:Reference URI="#DeviceDAToken"/>
                    </wsse:SecurityTokenReference>
                </KeyInfo>
            </Signature>
        </wsse:Security>
    </s:Header>
    <s:Body>
        <ps:RequestMultipleSecurityTokens xmlns:ps="http://schemas.microsoft.com/Passport/SoapServices/PPCRL" Id="RSTS">
            <wst:RequestSecurityToken Id="RST0">
                <wst:RequestType>http://schemas.xmlsoap.org/ws/2005/02/trust/Issue</wst:RequestType>
                <wsp:AppliesTo>
                    <wsa:EndpointReference>
                        <wsa:Address>scope=service::ads.arcct.msn.com::MBI_SSL&amp;uaid=00000000-0000-0000-0000-000000000000&amp;clientid=00000000-0000-0000-0000-000000000000</wsa:Address>
                    </wsa:EndpointReference>
                </wsp:AppliesTo>
                <wsp:PolicyReference URI="TOKEN_BROKER"></wsp:PolicyReference>
            </wst:RequestSecurityToken>
            <wst:RequestSecurityToken Id="RST1">
                <wst:RequestType>http://schemas.xmlsoap.org/ws/2005/02/trust/Issue</wst:RequestType>
                <wsp:AppliesTo>
                    <wsa:EndpointReference>
                        <wsa:Address>http://Passport.NET/tb</wsa:Address>
                    </wsa:EndpointReference>
                </wsp:AppliesTo>
            </wst:RequestSecurityToken>
        </ps:RequestMultipleSecurityTokens>
    </s:Body>
</s:Envelope>

<!-- POST https://login.live.com/RST2.srf HTTP/1.0
Connection: Keep-Alive
Content-Type: application/soap+xml
Accept: */*
User-Agent: MSAWindows/50 (OS 10.0.25398.0.0 xb_flt_2406zn; IDK 10.0.25398.4897 xb_flt_2406zn; Cfg 16.000.29325.00; Test 0)
Content-Length: 6253
Host: login.live.com -->
